posts/2020-05-02-org-notifications/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-Mode Calendar Notifications</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Org-Mode Calendar Notifications</h1>
</header><p>
I was wondering if I could create notifications for my calendar entries in
org-mode on Windows and Linux and it turns out, that the setup isn't that
complex.
</p>

<p>
The <code>appt</code> module can display notifications for specific appointments, so we
need to export org-mode entries as appointments:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'appt)
(appt-activate t)

(defun fw/org-agenda-to-appt ()
  "Rebuild all appt reminders using org."
  (interactive)
  (setq appt-time-msg-list nil)
  (org-agenda-to-appt))

(fw/org-agenda-to-appt)
(add-hook 'org-agenda-finalize-hook 'fw/org-agenda-to-appt)
</pre>
</div>

<p>
The above snippet will create appointments when Emacs boots up and every time
when we open <code>org-agenda</code>. The <code>appt</code> notifications appear in a mini-buffer,
which disappears after a few seconds. We can get persistent notifications by
using a different "backend" such as the Windows 10 notifications area (via the
PowerShell module <a href="https://github.com/Windos/BurntToast">BurntToast</a>) or the Linux command line tool <code>notify-send</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/appt-disp-linux (min-to-app new-time msg)
  "A custom `appt-disp-window-function' which uses `notifications'."
  (require 'notifications)
  (notifications-notify :title msg :timeout 0))

(defun fw/appt-disp-windows (min-to-app new-time msg)
  "A custom `appt-disp-window-function' which uses the PowerShell module 'BurntToast'"
  (shell-command
   (concat "powershell.exe -Command \"New-BurntToastNotification -Text '" msg "'\"")))

(when (eq system-type 'gnu/linux)
  (progn
    (setq appt-display-format 'window)
    (setq appt-disp-window-function (function fw/appt-disp-linux))
    (setq appt-delete-window-function (lambda nil))))

(when (eq system-type 'windows-nt)
  (progn
    (setq appt-display-format 'window)
    (setq appt-disp-window-function (function fw/appt-disp-windows))
    (setq appt-delete-window-function (lambda nil))))
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2020-05-02</p>
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
